### Concat - 상하결합

In [1]:
import pandas as pd
df1 = pd.DataFrame({'A': [1,2,3], 'B': [11,12,13], 'C': [21,22,23]})
df2 = pd.DataFrame({'A': [4,5,6], 'B': [14,15,16], 'C': [24,25,26]})

In [2]:
pd.concat([df1, df2])

   A   B   C
0  1  11  21
1  2  12  22
2  3  13  23
0  4  14  24
1  5  15  25
2  6  16  26

In [3]:
pd.concat([df2, df1])

   A   B   C
0  4  14  24
1  5  15  25
2  6  16  26
0  1  11  21
1  2  12  22
2  3  13  23

In [6]:
pd.concat([df1, df2], ignore_index=True) # 새로운 index 할당

   A   B   C
0  1  11  21
1  2  12  22
2  3  13  23
3  4  14  24
4  5  15  25
5  6  16  26

### join = outer -> 중복된 필드도 포함해서 결합

### join = inner -> 공통된 필드만을 포함하여 결합

In [9]:
df1 = pd.DataFrame({'A': [1,2,3], 'B': [11,12,13], 'C': [21,22,23], 'D': [31,32,33]})
df2 = pd.DataFrame({'A': [3,4,5], 'B': [13,14,15], 'C': [23,24,25], 'D': [41,42,43]})

In [12]:
pd.concat([df1, df2], join='outer') # join=;'outer'에서 값이 없는 부분은 NaN으로 채워짐

   A   B   C   D
0  1  11  21  31
1  2  12  22  32
2  3  13  23  33
0  3  13  23  41
1  4  14  24  42
2  5  15  25  43

### axis = 1 -> 좌우결합

In [16]:
df1 = pd.DataFrame({'A': [1,2,3], 'B': [11,12,13], 'C': [21,22,23], 'D': [31,32,33]})
df2 = pd.DataFrame({'E': [3,4,5], 'F': [13,14,15], 'G': [23,24,25], 'H': [41,42,43]})

In [17]:
pd.concat([df1, df2], axis=1)

   A   B   C   D  E   F   G   H
0  1  11  21  31  3  13  23  41
1  2  12  22  32  4  14  24  42
2  3  13  23  33  5  15  25  43

### Merge
- 두 개 이상의 데이터프레임을 공통된 열이나 인덱스를 기준으로 합치는데 사용
- 기준이 되는 열 또는 인덱스를 key라고 한다.

문제1. 다음 두 데이터 프레임을 'ID' 기준으로 결합하시오.

In [18]:
df1 = pd.DataFrame({'ID': [1,2,3,4,5], '성별': ['F','M','F','M','F'], '나이': [20,30,40,25,42]})
df2 = pd.DataFrame({'ID': [3,4,5,6,7], '키': [160.5, 170.3, 180.1, 142.3, 153.7], '몸무게': [45.1, 50.3, 72.1, 38.0, 42.0]})

In [21]:
df = pd.merge(df1, df2, on='ID') # df1과 df2에서 ID열이 일치하는 데이터만 병합

In [20]:
df

   ID 성별  나이      키   몸무게
0   3  F  40  160.5  45.1
1   4  M  25  170.3  50.3
2   5  F  42  180.1  72.1

문제2. 성별과 나이가 확인 된 유저들을 대상으로 키와 몸무게 정보를 결합하시오.
- df1의 모든 행을 포함하면서 df2의 해당하는 행이 있으면 해당 행을 포함하고 없으면 누락된 값을 채우면서 두 df를 병합하는 방법

In [3]:
df1 = pd.DataFrame({'ID': [1,2,3,4,5], '성별': ['F','M','F','M','F'], '나이': [20,30,40,25,42]})
df2 = pd.DataFrame({'ID': [3,4,5,6,7], '키': [160.5, 170.3, 180.1, 142.3, 153.7], '몸무게': [45.1, 50.3, 72.1, 38.0, 42.0]})

In [6]:
df = pd.merge(df1, df2, how='left', on='ID') # ID는 두 데이터 프레임에서 공통된 열

In [7]:
df[['성별', '나이', '키', '몸무게']]

  성별  나이      키   몸무게
0  F  20    NaN   NaN
1  M  30    NaN   NaN
2  F  40  160.5  45.1
3  M  25  170.3  50.3
4  F  42  180.1  72.1

문제3. 모든 유저의 정보를 출력하시오.

In [10]:
df = pd.merge(df1, df2, how='outer', on='ID')

In [11]:
df

   ID   성별    나이      키   몸무게
0   1    F  20.0    NaN   NaN
1   2    M  30.0    NaN   NaN
2   3    F  40.0  160.5  45.1
3   4    M  25.0  170.3  50.3
4   5    F  42.0  180.1  72.1
5   6  NaN   NaN  142.3  38.0
6   7  NaN   NaN  153.7  42.0

문제4. df1은 회원의 정보를 저장한 데이터 프레임이며, df2는 각 회원의 구매 내역을 저장한 데이터 프레임이다.<br>
각 회원의 누적 금액을 회원 ID별로 구하시오.

In [12]:
df1 = pd.DataFrame(
		{'ID' : [1,2,3,4,5], '가입일' : ['2021-01-02', '2021-01-04', '2021-01-10', '2021-02-10', '2021-02-24'],
		'성별' : ['F','M','F','M','M']})
df2 = pd.DataFrame(
		{'구매순서' : [1,2,3,4,5], 'ID' : [1,1,2,4,1],
		'구매월' : [1,1,2,2,3],
		'금액' : [1000,1500,2000,3000,4000]})

In [13]:
pd.merge(df1, df2, how='left', on='ID')

   ID         가입일 성별  구매순서  구매월      금액
0   1  2021-01-02  F   1.0  1.0  1000.0
1   1  2021-01-02  F   2.0  1.0  1500.0
2   1  2021-01-02  F   5.0  3.0  4000.0
3   2  2021-01-04  M   3.0  2.0  2000.0
4   3  2021-01-10  F   NaN  NaN     NaN
5   4  2021-02-10  M   4.0  2.0  3000.0
6   5  2021-02-24  M   NaN  NaN     NaN

In [14]:
money = df2.groupby(by=['ID'])['금액'].sum()

In [ ]:
pd.merge(df1, money, how='left', on='ID')